using System;
using System.Collections.Generic;
using System.Text;

namespace CodeWars.Kyu6
{
    /// <summary>
    ///     Decode the Morse code (Morse 1/3)
    /// </summary>
    /// <remarks>
    ///     https://www.codewars.com/kata/decode-the-morse-code/train/csharp
    /// </remarks>
    public class MorseCodeDecoder
    {
        private static readonly Dictionary<string, string> morseCodeMap = new Dictionary<string, string>
        {
            ["."] = "E",
            ["-"] = "T",

            [".."] = "I",
            [".-"] = "A",
            ["-."] = "N",
            ["--"] = "M",

            ["..."] = "S",
            ["..-"] = "U",
            [".-."] = "R",
            [".--"] = "W",
            ["-.."] = "D",
            ["-.-"] = "K",
            ["--."] = "G",
            ["---"] = "O",

            ["...."] = "H",
            ["...-"] = "V",
            ["..-."] = "F",
            ["..--"] = " ",
            [".-.."] = "L",
            [".-.-"] = " ",
            [".--."] = "P",
            [".---"] = "J",
            ["-..."] = "B",
            ["-..-"] = "X",
            ["-.-."] = "C",
            ["-.--"] = "Y",
            ["--.."] = "Z",
            ["--.-"] = "Q",
            ["---."] = " ",
            ["----"] = " ",

            ["....."] = "5",
            ["....-"] = "4",
            ["...-."] = " ",
            ["...--"] = "3",
            ["..-.."] = " ",
            ["..-.-"] = " ",
            ["..--."] = " ",
            ["..---"] = "2",
            [".-..."] = " ",
            [".-..-"] = " ",
            [".-.-."] = "+",
            [".-.--"] = " ",
            [".--.."] = " ",
            [".--.-"] = " ",
            [".---."] = " ",
            [".----"] = "1",
            ["-...."] = "6",
            ["-...-"] = "=",
            ["-..-."] = "/",
            ["-..--"] = " ",
            ["-.-.."] = " ",
            ["-.-.-"] = " ",
            ["-.--."] = " ",
            ["-.---"] = " ",
            ["--..."] = "7",
            ["--..-"] = " ",
            ["--.-."] = " ",
            ["--.--"] = " ",
            ["---.."] = "8",
            ["---.-"] = " ",
            ["----."] = "9",
            ["-----"] = "0",

            ["......"] = " ",
            [".....-"] = " ",
            ["....-."] = " ",
            ["....--"] = " ",
            ["...-.."] = " ",
            ["...-.-"] = " ",
            ["...--."] = " ",
            ["...---"] = " ",
            ["..-..."] = " ",
            ["..-..-"] = " ",
            ["..-.-."] = " ",
            ["..-.--"] = " ",
            ["..--.."] = "?",
            ["..--.-"] = "_",
            ["..---."] = " ",
            ["..----"] = " ",
            [".-...."] = " ",
            [".-...-"] = " ",
            [".-..-."] = "\"",
            [".-..--"] = " ",
            [".-.-.."] = " ",
            [".-.-.-"] = ".",
            [".-.--."] = " ",
            [".-.---"] = " ",
            [".--..."] = " ",
            [".--..-"] = " ",
            [".--.-."] = "@",
            [".--.--"] = " ",
            [".---.."] = " ",
            [".---.-"] = " ",
            [".----."] = "'",
            [".-----"] = " ",

            ["-....."] = " ",
            ["-....-"] = "-",
            ["-...-."] = " ",
            ["-...--"] = " ",
            ["-..-.."] = " ",
            ["-..-.-"] = " ",
            ["-..--."] = " ",
            ["-..---"] = " ",
            ["-.-..."] = " ",
            ["-.-..-"] = " ",
            ["-.-.-."] = ";",
            ["-.-.--"] = "!",
            ["-.--.."] = " ",
            //["-.--.-"] = "()",
            ["-.---."] = " ",
            ["-.----"] = " ",
            ["--...."] = " ",
            ["--...-"] = " ",
            ["--..-."] = " ",
            ["--..--"] = ",",
            ["--.-.."] = " ",
            ["--.-.-"] = " ",
            ["--.--."] = " ",
            ["--.---"] = " ",
            ["---..."] = ":",
            ["---..-"] = " ",
            ["---.-."] = " ",
            ["---.--"] = " ",
            ["----.."] = " ",
            ["----.-"] = " ",
            ["-----."] = " ",
            ["------"] = " ",

            ["...---..."] = "SOS"
        };

        public static string Decode(string morseCode)
        {
            var decode = new StringBuilder();
            var code = new StringBuilder();
            int spaceCount = 0;
            bool openParentheses = false;
            foreach (char c in morseCode)
                switch (c)
                {
                    case '.':
                    case '-':
                        if (spaceCount == 3)
                            decode.Append(' ');
                        code.Append(c);
                        spaceCount = 0;
                        break;
                    case ' ':
                        if (spaceCount == 0)
                        {
                            // 忽略前导的空格
                            if (code.Length > 0)
                            {
                                string key = code.ToString();
                                if (key == "-.--.-")
                                {
                                    decode.Append(openParentheses ? ')' : '(');
                                    openParentheses = !openParentheses;
                                }
                                else
                                {
                                    decode.Append(morseCodeMap[key]);
                                }
                                code.Length = 0;
                                spaceCount = 1;
                            }
                        }
                        else
                        {
                            spaceCount++;
                        }
                        break;
                    default:
                        throw new ArgumentException(nameof(morseCode));
                }

            if (code.Length > 0)
                decode.Append(morseCodeMap[code.ToString()]);

            return decode.ToString();
        }
    }
}
